### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cosmos.azurerm_cosmosdb_sql_container.installation_summaries will be created
  + resource "azurerm_cosmosdb_sql_container" "installation_summaries" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "push-notifications-cosmos-01"
      + id                  = (known after apply)
      + name                = "installation-summaries"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/nhPartition",
        ]
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 2000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.installation_summaries_lease will be created
  + resource "azurerm_cosmosdb_sql_container" "installation_summaries_lease" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "push-notifications-cosmos-01"
      + id                  = (known after apply)
      + name                = "installation-summaries-leases"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 2000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # module.cosmos.azurerm_cosmosdb_sql_database.push_notifications will be created
  + resource "azurerm_cosmosdb_sql_database" "push_notifications" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = "push-notifications-cosmos-01"
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.storage_api_weu.azurerm_storage_queue.update_installation_dispatch will be created
  + resource "azurerm_storage_queue" "update_installation_dispatch" {
      + id                   = (known after apply)
      + name                 = "update-installation-dispatch"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitncomst01"
      + url                  = (known after apply)
    }

  # module.storage_api_weu.azurerm_storage_queue.update_installation_dispatch_poison will be created
  + resource "azurerm_storage_queue" "update_installation_dispatch_poison" {
      + id                   = (known after apply)
      + name                 = "update-installation-dispatch-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitncomst01"
      + url                  = (known after apply)
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.push_notifications_database_contributor["cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "push_notifications_database_contributor" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/dbs/push-notifications"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.push_notifications_database_contributor["e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "push_notifications_database_contributor" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/dbs/push-notifications"
    }

  # module.web_apps.module.push_notif_function[0].azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.InstallationUpdateDispatcher.Disabled"                                               = "1"
          + "AzureWebJobs.UpdateInstallation.Disabled"                                                         = "1"
          + "COM_COSMOS__accountEndpoint"                                                                      = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "INSTALLATION_SUMMARIES_CONTAINER_NAME"                                                            = "installation-summaries"
          + "INSTALLATION_SUMMARIES_LEASE_CONTAINER_PREFIX"                                                    = "0-"
          + "PUSH_DATABASE_NAME"                                                                               = "push-notifications"
          + "UPDATE_ALL_INSTALLATIONS_TIME_TO_REACH"                                                           = "0"
            # (49 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-pushnotif-func-01"
        name                                           = "io-p-itn-com-pushnotif-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.push_notif_function[0].azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.InstallationUpdateDispatcher.Disabled"                                               = "1"
          + "AzureWebJobs.UpdateInstallation.Disabled"                                                         = "1"
          + "COM_COSMOS__accountEndpoint"                                                                      = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "INSTALLATION_SUMMARIES_CONTAINER_NAME"                                                            = "installation-summaries"
          + "INSTALLATION_SUMMARIES_LEASE_CONTAINER_PREFIX"                                                    = "0-"
          + "PUSH_DATABASE_NAME"                                                                               = "push-notifications"
          + "UPDATE_ALL_INSTALLATIONS_TIME_TO_REACH"                                                           = "0"
            # (50 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-pushnotif-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.
```

</details>
